## Eleman İşlemleri

In [1]:
import numpy as np
import pandas as pd

In [3]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [4]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}

In [5]:
sozluk

{'var1': array([0, 9, 4, 6, 4]),
 'var2': array([7, 4, 8, 0, 9]),
 'var3': array([9, 0, 1, 2, 3])}

In [6]:
df = pd.DataFrame(sozluk)

In [7]:
df

   var1  var2  var3
0     0     7     9
1     9     4     0
2     4     8     1
3     6     0     2
4     4     9     3

In [8]:
df[0:1]

   var1  var2  var3
0     0     7     9

In [9]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
df.index = ["a","b","c","d","e"]

In [12]:
df

   var1  var2  var3
a     0     7     9
b     9     4     0
c     4     8     1
d     6     0     2
e     4     9     3

In [13]:
df["c":"e"]

   var1  var2  var3
c     4     8     1
d     6     0     2
e     4     9     3

## Silme

In [14]:
df.drop("a", axis=0)

   var1  var2  var3
b     9     4     0
c     4     8     1
d     6     0     2
e     4     9     3

In [15]:
df

   var1  var2  var3
a     0     7     9
b     9     4     0
c     4     8     1
d     6     0     2
e     4     9     3

In [16]:
df.drop("a", axis= 0, inplace= True) #DataFrame üzerindeki değişikliğin kalıcı olmasını sağlar.

In [17]:
df

   var1  var2  var3
b     9     4     0
c     4     8     1
d     6     0     2
e     4     9     3

## Fancy

In [18]:
l = ["c","e"]
df.drop(l, axis=0)

   var1  var2  var3
b     9     4     0
d     6     0     2

In [19]:
"var1" in df

True

In [20]:
l = ["var1","var2","var3"]

In [21]:
for i in l:
    print(i in df)

True
True
True

In [22]:
df

   var1  var2  var3
b     9     4     0
c     4     8     1
d     6     0     2
e     4     9     3

In [23]:
df["var4"] = df["var1"] / df["var3"]

In [24]:
df

   var1  var2  var3      var4
b     9     4     0       inf
c     4     8     1  4.000000
d     6     0     2  3.000000
e     4     9     3  1.333333

In [25]:
df.drop("var4", axis=1, inplace= True)

In [26]:
df

   var1  var2  var3
b     9     4     0
c     4     8     1
d     6     0     2
e     4     9     3

In [27]:
l = ["var1","var2"]

In [28]:
df.drop(l, axis=1)

   var3
b     0
c     1
d     2
e     3